## EDA- Exploratory data analysis

EDA-Exploratory Data Analysis 
LIBRARIES:- 
1.Numpy-for arrays, image processing 
2.Pandas-labelled data analysis(like excel){has rows and columns} 
3.matplotlib-for visualization 
4.seaborn-actually use for visualization{all types of statistical plotting-mean,median} 
5.scikitlearn-primary library for ml

NOTES:-
#-comments. 
Last line is always printed.

## Basic data types

1.List-[],can contain elemts of diff dataype as well.
2.dictionary-{}; collection of key value
3.tuple-(). list is mutable<can add or remove elements>, tuple is immutable<can't change>.

In [ ]:
## Examples for list,dictionary and tuple

## Data frames with pandas

import pandas as pd-(pd means pandas).
df=data frame(df is for pandas ;for rows and coloums). if you write df, it'll print the rows and cols
pandas s built on numpy. numpy doesn't have labels like column name. in df, we can call column name.
df.dtypes= each col's datat type
datatype=object means it is a string
eg.import pandas as indhu; indhu.read_csv("");
(for numpy) import numpy as np{this is a standard}
[for importing specific stuff] from pandas import read_csv
pd to csv{to change original csv file}
in pandas,row index is important. we can define own index as well. Columns are called series, which is a datatype.
A dataframe is made up multiple series(columns)
df.head gives firsts 5 lines. head() is a function
df.shape tells how many rows and columns are there
df.tail shows alst rows which shows the summation of the respective series. NaN =not any number
NaN is used to remove junk values. you delete all NaN to do that
in dictionary, keys=column name; values are series content

pd.to_datetime("2002-11-02")
adding column todf=changes original df ; when removing a col=original won't be changed
NaT=not any time
df.describe= it will describe a df
value_counts=says the frequency of it
SELECTING: 1.iloc-old version(acessing rows and column by number) 2.loc-acessing by name
in df, i can add/remove cols. Origignal data can be changed or not changed.

In [3]:
import pandas as wakamura
df=wakamura.read_csv("Uber Drives 2016.csv")
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

## Basic dataframe operations

In [4]:
df.shape        #will tell you the no of rows and cols

(1156, 7)

In [5]:
df.tail()       #will give you the summation of the series at the bottom of the df

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [6]:
df.dtypes         #gives the datatype present in the df

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

## Changing datatypes

In [20]:
omega=wakamura.DataFrame({1:["a","b","c"], 2:["ari","wari","sori"],3:["12","99","2"],4:["12-06-2021","5-4-1999","23.9.2032"]})

In [21]:
omega

   1     2   3           4
0  a   ari  12  12-06-2021
1  b  wari  99    5-4-1999
2  c  sori   2   23.9.2032

In [23]:
omega.dtypes

1    object
2    object
3    object
4    object
dtype: object

In [24]:
omega[4]=wakamura.to_datetime(omega[4])

In [25]:
omega

   1     2   3          4
0  a   ari  12 2021-12-06
1  b  wari  99 1999-05-04
2  c  sori   2 2032-09-23

In [27]:
omega.dtypes

1            object
2            object
3            object
4    datetime64[ns]
dtype: object

In [29]:
wakamura.to_datetime(["2022-oct-19","stu","001"],errors="coerce")  #if ‘coerce’, then invalid parsing will be set as NaN

DatetimeIndex(['2022-10-19', 'NaT', 'NaT'], dtype='datetime64[ns]', freq=None)

In [31]:
omega[1]=wakamura.to_numeric(omega[1])

ValueError: Unable to parse string "a" at position 0

In [32]:
omega

   1     2   3          4
0  a   ari  12 2021-12-06
1  b  wari  99 1999-05-04
2  c  sori   2 2032-09-23

In [33]:
omega.dtypes

1            object
2            object
3            object
4    datetime64[ns]
dtype: object

# Dataset summarization methods

In [38]:
df.describe(include="all")

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
count,1156,1155,1155,1155,1155,1156.000000,653
unique,1155,1154,2,177,188,NaN,10
top,6/28/2016 23:34,6/28/2016 23:59,Business,Cary,Cary,NaN,Meeting
freq,2,2,1078,201,203,NaN,187
mean,NaN,NaN,NaN,NaN,NaN,21.115398,NaN
std,NaN,NaN,NaN,NaN,NaN,359.299007,NaN
min,NaN,NaN,NaN,NaN,NaN,0.500000,NaN
25%,NaN,NaN,NaN,NaN,NaN,2.900000,NaN
50%,NaN,NaN,NaN,NaN,NaN,6.000000,NaN
75%,NaN,NaN,NaN,NaN,NaN,10.400000,NaN
max,NaN,NaN,NaN,NaN,NaN,12204.700000,NaN

## Doubt
# run it and check
df=wakamura(omega)
df.describe(include="START*")

In [39]:
df["START*"].value_counts()

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
                   ...
Sky Lake              1
Arabi                 1
Winston Salem         1
North Austin          1
Tribeca               1
Name: START*, Length: 177, dtype: int64

In [40]:
df["START*"].value_counts().head()

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
Name: START*, dtype: int64

# Common data manipulation tasks
5 verbs of data manipulation:-

1.Selecting/Indexing
2.Filtering
3.Sorting
4.Mutating/ Conditionally adding columns
5.Groupby/Summarize

# selecting/ indexing

In [41]:
pizza=df.iloc[:,:-1]

In [42]:
print(df.shape)

(1156, 7)

In [43]:
pizza.shape

(1156, 6)

In [44]:
pizza

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7
...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2
1155,Totals,NaN,NaN,NaN,NaN,12204.7

In [46]:
### Positional Indexing
df.iloc[2:4,[1,3]]

        END_DATE*       START*
2  1/2/2016 20:38  Fort Pierce
3  1/5/2016 17:45  Fort Pierce

In [49]:
# label based indexing
df.loc[4:9,["CATEGORY*","MILES*"]]

  CATEGORY*  MILES*
4  Business    63.7
5  Business     4.3
6  Business     7.1
7  Business     0.8
8  Business     8.3
9  Business    16.5

In [55]:
ra=df.loc[4:9,["CATEGORY*","MILES*"]]
ra

  CATEGORY*  MILES*
4  Business    63.7
5  Business     4.3
6  Business     7.1
7  Business     0.8
8  Business     8.3
9  Business    16.5

In [50]:
omn=df.loc[:,"MILES*"]

In [51]:
omn

0           5.1
1           5.0
2           4.8
3           4.7
4          63.7
         ...
1151        3.9
1152       16.2
1153        6.4
1154       48.2
1155    12204.7
Name: MILES*, Length: 1156, dtype: float64

In [52]:
type(omn)

pandas.core.series.Series